/*===================================================================================================
                		Copyright(C) 2011-2099.  SUNRAM. Co., Ltd.
-----------------------------------------------------------------------------------------------------
Project Name  		: CommMotDrv.h
Description   		: H
Author        		: Wuhaiming
Start Date    		: 2023/08/19
Version       		: V1.0
Revision History   1:
                   2:
===================================================================================================*/ 

#ifndef    _COMMMOTDRV_H_

#define	   _COMMMOTDRV_H_

//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
//相关宏定义
#define    C_COMMMOTDRV_TX_SRCADDR     	   0x01        //通讯源地址
#define    C_COMMMOTDRV_TX_TAGADDR	   	   0x00		   //通讯目标地址
#define    C_COMMMOTDRV_RX_SRCADDR     	   0x00        //通讯源地址
#define    C_COMMMOTDRV_RX_TAGADDR	   	   0x01		   //通讯目标地址
#define    C_COMMMOTDRV_CMD_BASERUN        0x20		   //基本运行指令
#define    C_COMMMOTDRV_CMD_REQSET	   	   0x50		   //查询、设置命令
#define	   C_COMMMOTDRV_LENTH		   	   0x0D		   //参数长度
//--------------------------------------------------------------------------------------------------//

//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    enum
{
//	U8    f_OnOff		:1;		//bit0    开关标志
//	U8	  Reserved0		:1;		//bit1	  预留
//	U8	  f_Turbo		:1;		//bit2	  强力模式
//	U8	  f_Auto		:1;		//bit3	  自动模式
//	U8	  f_Purify		:1;		//bit4	  净化模式
//	U8	  f_Sleep		:1;		//bit5	  睡眠模式
//	U8	  Reserved1		:1;		//bit6	  预留
//	U8	  Reserved2		:1;		//bit7	  预留
	
	
	ENUM_MBDXBYTE5_RESERVED,	//预留
	ENUM_MBDXBYTE5_COOL,		//制冷
	ENUM_MBDXBYTE5_DRY,			//除湿
	ENUM_MBDXBYTE5_ONLYFAN,		//只送风
	ENUM_MBDXBYTE5_HEAT,		//制热
	ENUM_MBDXBYTE5_OFF,			//关机
	ENUM_MBDXBYTE5_FORCECOOL,	//强制制冷
	ENUM_MBDXBYTE5_DEFROST,		//化霜
	ENUM_MBDXBYTE5_COOLDRY,		//干燥清洁
	ENUM_MBDXBYTE5_COOLECO,		//制冷节能模式
//	ENUM_MBDXBYTE5_INTE,		//智能模式
}ENUM_MBDXBYTE5;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    ENUM_MBDXBYTE5      InDoorRunMode;	//当前室内机的运转模式
	U8    			  	Byte;
}UNION_MBTXBYTE5;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    			  OutDoorTargetFreq;	//要求室外机运转目标频率(整数部分)
	U8    			  Byte;
}UNION_MBTXBYTE6;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    			  OutDoorTargetFreqDotMul60;	//要求室外机运转目标频率(小数部分*60)
	U8    			  Byte;
}UNION_MBTXBYTE7;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    			  InDoorTempSet;		//当前室内机的设置温度	2*TS+30
	U8    			  Byte;
}UNION_MBTXBYTE8;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    			  InDoorTemp;			//当前室内机的环境温度	2*T1+30
	U8    			  Byte;
}UNION_MBTXBYTE9;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
    U8    f_FanSpeed    :1;        //风机失速 Ed
	U8    f_EEPROM		:1;		   //EEPROM故障 F2
	U8    f_CommDisp	:1;		   //室内板与显示板通信故障 E8
	U8    f_TempRoom	:1;		   //T1传感器故障
	U8    f_TempCoil1	:1;		   //T2传感器故障
	U8    f_TempCoil2	:1;		   //T3传感器故障	
	U8    f_TempOutDoor	:1;		   //T4传感器故障
	U8    f_TempExhaust :1;		   //TP传感器故障
}STRUCT_MBTXBYTE10;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    STRUCT_MBTXBYTE10    InDoorProtect1;		//当前室内机保护状态1			
	U8    			  	 Byte;
}UNION_MBTXBYTE10;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_AntiCold        	  :1;        //防冻结保护
	U8    f_TempCoil2HighTemp     :1;		 //盘管2高温保护
	U8	  f_HumiModule		      :1;		 //湿度传感器故障
	U8	  f_Pump			      :1;		 //水泵保护功能
	U8    f_FDP				      :1;		 //缺氟保护
	U8    f_CommMotDrv		      :1;		 //室内与驱动板通信故障
	U8    f_TempExhaustHighTemp	  :1;		 //排气高温保护
	U8	  Reserved			      :1;		 //预留
}STRUCT_MBTXBYTE11;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    STRUCT_MBTXBYTE11    InDoorProtect2;		//当前室内机保护状态2			
	U8    			  	 Byte;
}UNION_MBTXBYTE11;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_ExhaustLimit        :1;        //排气限频
	U8	  f_Coil1Limit			:1;		   //盘管1限频
	U8	  f_Coil2Limit			:1;		   //盘管2限频
	U8    f_T4Limit				:1;		   //T4限频
	U8    f_Sleep				:1;		   //睡眠标志
	U8    f_ForceMode			:1;		   //强力标志
	U8	  Reserved0				:2;		   //预留
}STRUCT_MBTXBYTE12;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    STRUCT_MBTXBYTE12    	InDoorProtect3;			//当前室内机保护状态3		
	U8    			  		Byte;
}UNION_MBTXBYTE12;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    			  InDoorFanSpeedDiv10;			//当前室内风机风速(实际值/10)
	U8    			  Byte;
}UNION_MBTXBYTE13;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    			  TempCoil1;				//当前室内管温温度值1	2*T+30
	U8    			  Byte;
}UNION_MBTXBYTE14;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    			  TempCoil2;				//当前室内管温温度值2	2*T+30
	U8    			  Byte;
}UNION_MBTXBYTE15;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    			  TempExhaust;				//当前压缩机排气温度	T+30 故障发0x00
	U8    			  Byte;
}UNION_MBTXBYTE16;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_FastChk         :1;        //快检状态
	U8    f_DeMold		    :1;		   //防霉功能标志
	U8	  f_Ventilate		:1;		   //通风逻辑标志
	U8	  f_CompPre			:1;		   //压缩机预热标志
	U8	  f_FanOutdoorOn	:1;		   //外风机开关标志	
	U8    f_bit5			:1;		   //bit5,6,7组合	能力测试(010:中间能力, 001最大能力, 011最小能力, 100额定能力, 110:25%能力)
	U8    f_bit6			:1;		   //bit5,6,7组合
	U8    f_bit7			:1;		   //bit5,6,7组合
	
}STRUCT_MBTXBYTE17;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    STRUCT_MBTXBYTE17    InDoorStatus;		//当前室内机的状态		
	U8    			  	 Byte;
}UNION_MBTXBYTE17;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
    UNION_MBTXBYTE5     Byte5;
    UNION_MBTXBYTE6     Byte6;
    UNION_MBTXBYTE7     Byte7;
	UNION_MBTXBYTE8	    Byte8;
	UNION_MBTXBYTE9	    Byte9;
	UNION_MBTXBYTE10    Byte10;
	UNION_MBTXBYTE11    Byte11;
	UNION_MBTXBYTE12    Byte12;
	UNION_MBTXBYTE13    Byte13;
	UNION_MBTXBYTE14    Byte14;
	UNION_MBTXBYTE15    Byte15;
	UNION_MBTXBYTE16    Byte16;
	UNION_MBTXBYTE17    Byte17;
}STRUCT_BASERUN_TX;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	ENUM_MBDXBYTE5      OutDoorRunMode;	//当前室外机的运转模式
	U8    			  	Byte;
}UNION_MBRXBYTE5;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	U8    			  OutDoorRealFreqL;	//当前室外机运转的实际频率(低位)
	U8    			  Byte;
}UNION_MBRXBYTE6;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	U8    			  OutDoorRealFreqH;	//当前室外机运转的实际频率(高位)
	U8    			  Byte;
}UNION_MBRXBYTE7;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	U8    			  OutDoorRealRPMDiv10;	//室外风机转速  实际值除10(RPM)
	U8    			  Byte;
}UNION_MBRXBYTE8;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	U8    			  OutDoorCurrentMul8;	//室外机电流值 实际值乘以8
	U8    			  Byte;
}UNION_MBRXBYTE9;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	U8    			  OutDoorVoltDiv2;		//当前室外机的直流电压有效值 实际值除以2
	U8    			  Byte;
}UNION_MBRXBYTE10;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_CurrentLimitFreq	:1;			//Bit0：电流限频
	U8    f_IPMTempLimitFreq	:1;			//Bit1：IPM温度限频
	U8	  f_VoltLimitFreq		:1;			//Bit2：电压限频
	U8	  f_IPMTempProtect		:1;			//Bit3：IPM模块温度保护
	U8	  f_CurrentProtect		:1;			//Bit4：室外机电流保护
	U8	  f_CommErr				:1;			//Bit5：通信故障		
	U8    f_EEPROMErr			:1;			//Bit6：E方故障系统参数错误	
	U8    f_FanIndoorErr		:1;			//Bit7：内机风机故障
	
}STRUCT_MBRXBYTE11;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MBRXBYTE11    OutDoorStatus1;        //当前室外机的状态1
	U8    			  	 Byte;
}UNION_MBRXBYTE11;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{	
	U8    f_PFCSwitchOff	   :1;		    //Bit0: PFC模块开关停机
	U8    f_IPMSensorErr	   :1;		    //Bit1: IPM模块温度开路或短路
	U8    f_ACVoltLowPro	   :1;		    //Bit2: 交流电压过低保护
	U8	  f_HighFreqStartErr   :1;		    //Bit3: 高频启动故障
	U8    f_CompOvCurrErr	   :1;		    //Bit4: 压机过电流故障P49
	U8	  f_CompIPMPro		   :1;		    //Bit5: 压缩机IPM模块保护P0
	U8    f_VoltLowPro		   :1;		    //Bit6: 电压过低保护P10
	U8    f_VoltHighPro		   :1;		    //Bit7: 电压过高保护P11
	
}STRUCT_MBRXBYTE12;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MBRXBYTE12    OutDoorStatus2;        //当前室外机的状态2
	U8    			  	 Byte;
}UNION_MBRXBYTE12;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{	
	U8    Reserved0            :1;		    //Bit0：预留	
	U8    f_CompOvCurr         :1;          //Bit1：压缩机过流P41
	U8    f_CompStartErr	   :1;			//Bit2: 压缩机启动故障P42
	U8    f_CompPhasePro	   :1;			//Bit3: 压缩机缺相保护P43
	U8    f_CompZeroSpeedPro   :1;			//Bit4: 压缩机零速保护P44
	U8    f_VoltLessQuickPro   :1;			//Bit5: 电压瞬降保护P45
	U8    f_CompLostSpeedPro   :1;			//Bit6: 压缩机失速保护P46
	U8    f_PFCOffQuick		   :1;			//Bit7: PFC瞬间关断P47
}STRUCT_MBRXBYTE13;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MBRXBYTE13    OutDoorStatus3;        //当前室外机的状态3
	U8    			  	 Byte;
}UNION_MBRXBYTE13;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_TpHighLimit			:1;			//Bit0: 压机排气高温限频L2
	U8    f_TpHighPro			:1;			//Bit1: 压机排气高温保护P6
	U8    f_T3HighLimit			:1;			//Bit2: 冷凝器高温限频L1
	U8    f_T3HighPro			:1;			//Bit3: 冷凝器高温保护PA
	U8    Reserved0				:4;			//预留
}STRUCT_MBRXBYTE14;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MBRXBYTE14    OutDoorStatus4;        //当前室外机的状态4
	U8    			  	 Byte;
}UNION_MBRXBYTE14;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_CompPreHeat			:1;			//Bit0: 压缩机预热标志
	U8    Reserved0			    :7;			//预留
}STRUCT_MBRXBYTE15;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MBRXBYTE15    OutDoorStatus5;        //当前室外机的状态5
	U8    			  	 Byte;
}UNION_MBRXBYTE15;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_FanOutdoorErr		:1;			//Bit0: 室外直流风机故障E7
	U8    f_FanOutdoorOvCurr	:1;			//Bit1: 外风机过流(外置驱动)
	U8    f_FanOutdoorLostSpd	:1;			//Bit2: 外风机失速(外置驱动)
	U8    f_FanOutdoorLostPhase :1;			//Bit3: 外风机缺相(外置驱动)
	U8    f_FanOutdoorZeroSpd   :1;			//Bit4: 外风机零速(外置驱动)
	U8    Reserved0			    :3;			//预留
}STRUCT_MBRXBYTE16;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MBRXBYTE16    OutDoorStatus6;        //当前室外机的状态6
	U8    			  	 Byte;
}UNION_MBRXBYTE16;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	U8    			  FanIndoorRealRPMDiv10;		//内风机实际转速DIV10
	U8    			  Byte;
}UNION_MBRXBYTE17;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct	
{
    UNION_MBRXBYTE5     Byte5;
	UNION_MBRXBYTE6     Byte6;
	UNION_MBRXBYTE7     Byte7;
	UNION_MBRXBYTE8     Byte8;
	UNION_MBRXBYTE9     Byte9;
	UNION_MBRXBYTE10    Byte10;
	UNION_MBRXBYTE11	Byte11;
	UNION_MBRXBYTE12	Byte12;
	UNION_MBRXBYTE13	Byte13;
	UNION_MBRXBYTE14    Byte14;
	UNION_MBRXBYTE15	Byte15;
	UNION_MBRXBYTE16	Byte16;
	UNION_MBRXBYTE17	Byte17;	
	
}STRUCT_BASERUN_RX;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
    STRUCT_BASERUN_TX    Tx;
	STRUCT_BASERUN_RX	 Rx;
}STRUCT_BASERUN;		//基本运行指令

//==================================================================================================//
//==================================================================================================//

typedef    union
{
    U8    u8_CompFreqSet;        	 //压缩机频率设定（整数部分）
	U8    Byte;
}UNION_MRTXBYTE5;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    u8_OutDoorFanSpeedSetL;    //室外风机风速设定（低字节）
	U8    Byte;
}UNION_MRTXBYTE6;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    u8_OutDoorFanSpeedSetH;    //室外风机风速设定（高字节）
	U8    Byte;
}UNION_MRTXBYTE7;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    u8_OutDoorEpsValveSetL;    //室外电子膨胀阀开度设定（低字节）
	U8    Byte;
}UNION_MRTXBYTE8;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    u8_OutDoorEpsValveSetH;    //室外电子膨胀阀开度设定（高字节）
	U8    Byte;
}UNION_MRTXBYTE9;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    enum
{
	ENUM_FOURWAYVALVE_COMMON,       //0：正常控制
	ENUM_FOURWAYVALVE_SETON,        //1：四通阀强制开
	ENUM_FOURWAYVALVE_SETOFF,		//2：四通阀强制关
}ENUM_FOURWAYVALVE;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    ENUM_FOURWAYVALVE    Enum_FourWay;    //四通阀开关设定
	U8    				 Byte;
}UNION_MRTXBYTE10;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    u8_TempExhaustTarget;    		  //排气目标温度
	U8    Byte;
}UNION_MRTXBYTE11;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    enum
{
	ENUM_FORCESET_REQ,					  //0：查询
	ENUM_FORCESET_TESTBOARD,			  //1：调试小板设定
	ENUM_FORCESET_REMOTE,				  //2：遥控器设定
}ENUM_FORCESET;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    ENUM_FORCESET    	 Enum_ForceSet;   //设定强制设定方式
	U8    				 Byte;
}UNION_MRTXBYTE12;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    enum
{
	ENUM_BYPASSVALVESET_OFF,			  //0：旁通阀关
	ENUM_BYPASSVALVESET_ON,			  	  //1：旁通阀开

}ENUM_BYPASSVALVESET;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    ENUM_BYPASSVALVESET    	 Enum_BypassValveSet;   //旁通阀开关设定
	U8    				 	 Byte;
}UNION_MRTXBYTE13;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    u8_CompFreqDotSet;    		  //压缩机频率设定（小数部分）
	U8    Byte;
}UNION_MRTXBYTE14;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    u8_Reserved0;    		  		 //预留
	U8    Byte;
}UNION_MRTXBYTE15;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    u8_Reserved1;    		  		 //预留
	U8    Byte;
}UNION_MRTXBYTE16;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    union
{
    U8    u8_Reserved2;    		  		 //预留
	U8    Byte;
}UNION_MRTXBYTE17;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
    UNION_MRTXBYTE5     Byte5;
	UNION_MRTXBYTE6		Byte6;
	UNION_MRTXBYTE7		Byte7;
	UNION_MRTXBYTE8		Byte8;
	UNION_MRTXBYTE9		Byte9;	
	UNION_MRTXBYTE10	Byte10;
	UNION_MRTXBYTE11	Byte11;
	UNION_MRTXBYTE12	Byte12;
	UNION_MRTXBYTE13	Byte13;
	UNION_MRTXBYTE14	Byte14;
	UNION_MRTXBYTE15	Byte15;
	UNION_MRTXBYTE16	Byte16;
	UNION_MRTXBYTE17	Byte17;	
}STRUCT_REQSET_TX;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_OutDoorEEPROMErr    :1;        //Bit0：室外E方故障E51
	U8	  f_OutDoorT3Err		:1;		   //Bit1：室外T3传感器故障E52
	U8	  f_OutDoorT4Err		:1;		   //Bit2：室外T4传感器故障E51
	U8	  f_OutDoorTPErr		:1;		   //Bit3：室外TP传感器故障E54
	U8	  f_ModuleTempErr		:1;		   //Bit4：模块温度传感器故障E55
	U8	  f_Reserved0			:1;		   //Bit5: 预留
	U8	  f_OutDoorFanErr		:1;		   //Bit6：室外直流风机故障E7
	U8	  f_Reserved1			:1;		   //Bit7：预留	
}STRUCT_MRRXBYTE5;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MRRXBYTE5    OutDoorStatus1;		//当前室外机状态1
	U8					Byte;
}UNION_MRRXBYTE5;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_Reserved0			:1;			//Bit0：预留（P40）
	U8	  f_CompOvCurrent		:1;			//Bit1：压缩机过流 P41
	U8	  f_CompStartErr		:1;			//Bit2：压机启动故障P42
	U8	  f_CompPhaseProtect	:1;			//Bit3：压机缺相保护P43
	U8	  f_CompZeroProtect		:1;			//Bit4：压机零速保护P44
	U8	  f_CompVoltLowQProtect :1;			//Bit5：电压瞬降保护P45
	U8	  f_CompLostSpeedProtect:1;			//Bit6：压机失速保护P46
	U8	  f_PFCOffProtect		:1;			//Bit7：PFC瞬间关断P47
}STRUCT_MRRXBYTE6;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MRRXBYTE6    OutDoorStatus2;		//当前室外机状态2
	U8					Byte;
}UNION_MRRXBYTE6;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_Reserved0			 :1;		//Bit0：预留
	U8	  f_CompOvCurrentErr	 :1;		//Bit1：压机过电流故障P49
	U8	  f_OutDoorIPMProtect	 :1;		//Bit2：室外IPM模块保护P0
	U8	  f_VoltLowProtect		 :1;		//Bit3：电压过低保护	P10
	U8	  f_VoltHighProtect		 :1;		//Bit4：电压过高保护P11
	U8	  f_OutDoorDCVoltProtect :1;		//Bit5：室外直流侧电压保护
	U8	  f_OutDoorCurrentProtect:1;		//Bit6：室外电流保护P81
	U8	  f_Reserved1			 :1;		//Bit7：预留
}STRUCT_MRRXBYTE7;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MRRXBYTE7    OutDoorStatus3;		//当前室外机状态3
	U8					Byte;
}UNION_MRRXBYTE7;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_CompTPHighFreqLimit	 :1;		//Bit0：压机排气高温限频L2
	U8    f_CompTPHighProtect	 :1;		//Bit1：压机排气高温保护P6
	U8	  f_CdsTempHighFreqLimit :1;		//Bit2：冷凝器高温限频L1
	U8    f_CdsTempHighProtect	 :1;		//Bit3：冷凝器高温保护PA
	U8	  f_Reserved0			 :1;		//Bit4：预留
	U8	  f_Reserved1			 :1;		//Bit5：预留
	U8	  f_Reserved2			 :1;		//Bit6：预留
	U8	  f_Reserved3			 :1;		//Bit7：预留
}STRUCT_MRRXBYTE8;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MRRXBYTE8    OutDoorStatus4;		//当前室外机状态4
	U8					Byte;
}UNION_MRRXBYTE8;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_VoltFreqLimit		  :1;		//Bit0：电压限频L5
	U8	  f_CurrentFreqLimit	  :1;		//Bit1：电流限频、限频停机L3
	U8	  f_PFCSwitchOff		  :1;		//Bit2：PFC模块开关停机PF
	U8	  f_IPMErrFreqLimit		  :1;		//Bit3：IPM模块故障限频L6
	U8	  f_Reserved0			  :1;		//Bit4：预留
	U8	  f_Reserved1			  :1;		//Bit5：预留
	U8	  f_Reserved2			  :1;		//Bit6：预留
	U8	  f_Reserved3			  :1;		//Bit7：预留
}STRUCT_MRRXBYTE9;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MRRXBYTE9    OutDoorStatus5;		//当前室外机状态5
	U8					Byte;
}UNION_MRRXBYTE9;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	U8    f_OutDoorACFanLow		   :1;		//Bit0：交流风机室外低风
	U8    f_OutDoorACFanMed		   :1;		//Bit1：交流风机室外中风
	U8    f_OutDoorACFanHigh	   :1;		//Bit2：交流风机室外高风
	U8	  f_FourWayOnOff		   :1;		//Bit3：四通阀开关状态
	U8	  f_OutDoorFanOvCurrent	   :1;		//Bit4：外风机过流（外置驱动）
	U8	  f_OutDoorFanLostSpeed	   :1;		//Bit5：外风机失速（外置驱动）
	U8	  f_OutDoorFanLostPhase	   :1;		//Bit6：外风机缺相（外置驱动）
	U8	  f_OutDoorFanZero		   :1;		//Bit7：外风机零速（外置驱动）
}STRUCT_MRRXBYTE10;
//--------------------------------------------------------------------------------------------------//
typedef    union
{
	STRUCT_MRRXBYTE10    OutDoorStatus6;	//当前室外机状态6
	U8					 Byte;
}UNION_MRRXBYTE10;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef   union
{
	U8    u8_OutDoorFanSpeedDiv8;			//当前室外直流风机转速/8
	U8	  Byte;
}UNION_MRRXBYTE11;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef   union
{
	U8    u8_EpsValveOpenAngleDiv8;			//当前室外电子膨胀阀开度/8
	U8	  Byte;
}UNION_MRRXBYTE12;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef   union
{
	U8    u8_VoltBusValueDiv2;				//母线电压有效值/2
	U8	  Byte;
}UNION_MRRXBYTE13;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef   union
{
	U8    Reserved0;						//预留
	U8	  Byte;
}UNION_MRRXBYTE14;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef   union
{
	U8    IPMAdValue;						//IPM模块温度AD值
	U8	  Byte;
}UNION_MRRXBYTE15;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef   union
{
	U8    CompFreqReal;						//压机实际运行频率（整数部分）
	U8	  Byte;
}UNION_MRRXBYTE16;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef   union
{
	U8    CompFreqRealDot;					//压机实际运行频率（小数部分）
	U8	  Byte;
}UNION_MRRXBYTE17;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
	UNION_MRRXBYTE5     Byte5;
	UNION_MRRXBYTE6     Byte6;
	UNION_MRRXBYTE7     Byte7;
	UNION_MRRXBYTE8     Byte8;
	UNION_MRRXBYTE9     Byte9;
	UNION_MRRXBYTE10    Byte10;
	UNION_MRRXBYTE11	Byte11;
	UNION_MRRXBYTE12	Byte12;
	UNION_MRRXBYTE13	Byte13;
	UNION_MRRXBYTE14	Byte14;
	UNION_MRRXBYTE15	Byte15;
	UNION_MRRXBYTE16	Byte16;
	UNION_MRRXBYTE17	Byte17;	
}STRUCT_REQSET_RX;
//--------------------------------------------------------------------------------------------------//
//--------------------------------------------------------------------------------------------------//
typedef    struct
{
    STRUCT_REQSET_TX    Tx;
	STRUCT_REQSET_RX	Rx;
}STRUCT_REQSET;			//查询设置指令

//--------------------------------------------------------------------------------------------------//

typedef    struct
{
	U8                u8_Byte5;			//发送第5字节指令缓存
	U8                u8_Byte6;			//发送第6字节指令缓存	
	U8                u8_Byte7;			//发送第7字节指令缓存
	U8                u8_Byte8;			//发送第8字节指令缓存	
	U8                u8_Byte9;			//发送第9字节指令缓存
	U8                u8_Byte10;		//发送第10字节指令缓存	
	U8                u8_Byte11;		//发送第11字节指令缓存
	U8                u8_Byte12;		//发送第12字节指令缓存
	U8                u8_Byte13;		//发送第13字节指令缓存
	U8                u8_Byte14;		//发送第14字节指令缓存	
	U8                u8_Byte15;		//发送第15字节指令缓存
	U8                u8_Byte16;		//发送第16字节指令缓存
	U8                u8_Byte17;		//发送第17字节指令缓存
}STRUCT_MDDXBUF;

//--------------------------------------------------------------------------------------------------//

typedef    struct
{
	STRUCT_BASERUN    BaseRun;				//基本运行指令
	STRUCT_REQSET     ReqSet;				//查询设置指令
	STRUCT_MDDXBUF	  TxBuf;				//发送缓存
	STRUCT_MDDXBUF    RxBuf;				//接收缓存
	U8                u8_TXCommand;    		//运行命令(发送)
	U8				  u8_RXCommand;			//运行命令(接收)
}STRUCT_COMMMOTDRV;

extern    STRUCT_COMMMOTDRV    CommMotDrv;

#endif

/****************************************************************************************************
Function Name       :void    CommMotDrv_Con(void)
Description         :主控芯片与电机驱动芯片通信
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    CommMotDrv_InfoCon(void);





U8    BaseRunTx_Byte5_InDoorRunMode(void);




//---lhh--/
extern unsigned char l_outDoorMode;
