/*===================================================================================================
                		Copyright(C) 2011-2099.  SUNRAM. Co., Ltd.
-----------------------------------------------------------------------------------------------------
Project Name  		: Func.h
Description   		: H
Author        		: Wuhaiming
Start Date    		: 2022/03/12
Version       		: V1.0
Revision History   1:
                   2:
===================================================================================================*/ 

#ifndef			_FUNC_H_

#define			_FUNC_H_

//===================================================================================================//
//系统2ms运行一次事件(//使用打开/不使用屏蔽)
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT_PER2MS					Sys_Run_Per2ms()
//---------------------------------------------------------------------------------------------------//
//===================================================================================================//
//系统10ms运行一次事件(//使用打开/不使用屏蔽)
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT01_PER10MS					Sys_Run_Func1_Per10ms()
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT02_PER10MS					Sys_Run_Func2_Per10ms()
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT03_PER10MS					Sys_Run_Func3_Per10ms()
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT04_PER10MS					Sys_Run_Func4_Per10ms()
//---------------------------------------------------------------------------------------------------//
//===================================================================================================//
//系统100ms运行一次事件(//使用打开/不使用屏蔽)
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT01_PER100MS				Sys_Run_Func1_Per100ms()
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT02_PER100MS				Sys_Run_Func2_Per100ms()
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT03_PER100MS				Sys_Run_Func3_Per100ms()
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT04_PER100MS				Sys_Run_Func4_Per100ms()
//---------------------------------------------------------------------------------------------------//
#define			SYS_RUN_EVENT05_PER100MS				Sys_Run_Func5_Per100ms()
//---------------------------------------------------------------------------------------------------//
//#define			SYS_RUN_EVENT06_PER100MS				Sys_Run_Func6_Per100ms()
//---------------------------------------------------------------------------------------------------//
//#define			SYS_RUN_EVENT07_PER100MS				Sys_Run_Func7_Per100ms()
//---------------------------------------------------------------------------------------------------//
//#define			SYS_RUN_EVENT08_PER100MS				Sys_Run_Func8_Per100ms()
//---------------------------------------------------------------------------------------------------//
//#define			SYS_RUN_EVENT09_PER100MS				Sys_Run_Func9_Per100ms()
//---------------------------------------------------------------------------------------------------//
//#define			SYS_RUN_EVENT10_PER100MS				Sys_Run_Func10_Per100ms()
//---------------------------------------------------------------------------------------------------//
//===================================================================================================//
/****************************************************************************************************
Function Name       :void Data_Init(void)
Description         :数据初始化
Input               :无
Return              :无
Author              :冯锐辉
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Data_Init(void);

/****************************************************************************************************
Function Name       :void Init_MCU_Gpio(void)
Description         :初始化MCU端口
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Init_MCU_Gpio(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Per2ms(void)
Description         :系统2ms运行一次事件
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Per2ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func1_Per10ms(void)
Description         :系统10ms运行一次事件一
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func1_Per10ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func2_Per10ms(void)
Description         :系统10ms运行一次事件二
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func2_Per10ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func3_Per10ms(void)
Description         :系统10ms运行一次事件三
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func3_Per10ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func4_Per10ms(void)
Description         :系统10ms运行一次事件四
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func4_Per10ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func1_Per100ms(void)
Description         :系统100ms运行一次事件一
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func1_Per100ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func2_Per100ms(void)
Description         :系统100ms运行一次事件二
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func2_Per100ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func3_Per100ms(void)
Description         :系统100ms运行一次事件三
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func3_Per100ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func4_Per100ms(void)
Description         :系统100ms运行一次事件四
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func4_Per100ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func5_Per100ms(void)
Description         :系统100ms运行一次事件五
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func5_Per100ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func6_Per100ms(void)
Description         :系统100ms运行一次事件六
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func6_Per100ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func7_Per100ms(void)
Description         :系统100ms运行一次事件七
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func7_Per100ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func8_Per100ms(void)
Description         :系统100ms运行一次事件八
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func8_Per100ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func9_Per100ms(void)
Description         :系统100ms运行一次事件九
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func9_Per100ms(void);
/****************************************************************************************************
Function Name       :void Sys_Run_Func10_Per100ms(void)
Description         :系统100ms运行一次事件十
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
extern	void	Sys_Run_Func10_Per100ms(void);

#endif
