/*===================================================================================================
                		Copyright(C) 2011-2099.  SUNRAM. Co., Ltd.
-----------------------------------------------------------------------------------------------------
Project Name  		: Uart_app.h
Description   		: H
Author        		: Wuhaiming
Start Date    		: 2023/04/28
Version       		: V1.0
Revision History   1:
                   2:
===================================================================================================*/

#ifndef    _UART_APP_H_

#define    _UART_APP_H_

//===================================================================================================//
//---------------------------------------------------------------------------------------------------//
//UART0-UART5共性参数设置
//---------------------------------------------------------------------------------------------------//
#define 	C_UART_RXTIMEOUTCOUNT 			50 		    //接收一帧数据超时时间 5S
#define		C_UART_ABNORMALCOUNT			600		    //串口通信异1min
#define		C_UART_ERRCOUNT					1200		//串口通信异常(1min+2min)报错
//---------------------------------------------------------------------------------------------------//
//===================================================================================================//
//---------------------------------------------------------------------------------------------------//
//UART0
//---------------------------------------------------------------------------------------------------//
#define		C_UART0_TX_HEAD_FIRST			0xA5        //发送头码1
//#define		C_UART0_TX_HEAD_SECOND			0xFF        //发送头码2
//---------------------------------------------------------------------------------------------------//
#define		C_UART0_RX_HEAD_FIRST			0xA5        //接收头码1
//#define		C_UART0_RX_HEAD_SECOND			0xFF        //接收头码2
//---------------------------------------------------------------------------------------------------//
enum
{
    UART0_RX_HEAD_FIRST,			                    //头码1
//    UART0_RX_HEAD_SECOND,	                            //头码2

    UART0_RX_CHKSUML = 18,                              //校验-低位 
    UART0_RX_CHKSUMH = 19,								//校验-高位 
	UART0_RX_LEN     = 20,		                        //UART0接收字节长度
};
//---------------------------------------------------------------------------------------------------//
enum
{
    UART0_TX_HEAD_FIRST,			                    //头码1
//    UART0_TX_HEAD_SECOND,		                        //头码2
    
    UART0_TX_CHKSUML = 18,                              //校验-低位 
	UART0_TX_CHKSUMH = 19,								//校验-高位 
    UART0_TX_LEN     = 256,		                        //UART0发送字节长度
};
//---------------------------------------------------------------------------------------------------//
//===================================================================================================//
//---------------------------------------------------------------------------------------------------//
//UART1
//---------------------------------------------------------------------------------------------------//
#define		C_UART1_TX_HEAD_FIRST			0xFF        //发送头码1
#define		C_UART1_TX_HEAD_SECOND			0xFF        //发送头码2
//---------------------------------------------------------------------------------------------------//
#define		C_UART1_RX_HEAD_FIRST			0xFF        //接收头码1
#define		C_UART1_RX_HEAD_SECOND			0xFF        //接收头码2
//---------------------------------------------------------------------------------------------------//
enum
{
    UART1_RX_HEAD_FIRST,			                    //头码1
    UART1_RX_HEAD_SECOND,	                            //头码2

    UART1_RX_CHKSUM = 11,                               //校验
    UART1_RX_LEN    = 12,		                        //UART1接收字节长度
};
//---------------------------------------------------------------------------------------------------//
enum
{
    UART1_TX_HEAD_FIRST,			                    //头码1
    UART1_TX_HEAD_SECOND,		                        //头码2
    
    UART1_TX_CHKSUM = 11,                               //校验  
    UART1_TX_LEN    = 256,		                        //UART1发送字节长度
};
//---------------------------------------------------------------------------------------------------//
//===================================================================================================//
//---------------------------------------------------------------------------------------------------//
//UART2
//---------------------------------------------------------------------------------------------------//
#define		C_UART2_TX_HEAD_FIRST			0x02        //发送头码1
#define		C_UART2_TX_HEAD_SECOND03		0x03        //发送头码2-03查询
#define		C_UART2_TX_HEAD_SECOND06		0x06        //发送头码2-06修改
#define		C_UART2_TX_HEAD_SECOND10		0x10        //发送头码2-10修改

//---------------------------------------------------------------------------------------------------//
#define		C_UART2_RX_HEAD_FIRST			0x02        //接收头码1
#define		C_UART2_RX_HEAD_SECOND03		0x03        //接收头码2-03查询
#define		C_UART2_RX_HEAD_SECOND06		0x06        //接收头码2-06修改
#define		C_UART2_RX_HEAD_SECOND10		0x10        //接收头码2-10修改

//---------------------------------------------------------------------------------------------------//
enum
{
    UART2_RX_HEAD_FIRST,			                    //头码1
    UART2_RX_HEAD_SECOND,	                            //头码2

    UART2_RX_CHKSUM = 33,//254,                         //校验
    UART2_RX_LEN    = 80,//255,		                    //UART2接收字节长度
};
//---------------------------------------------------------------------------------------------------//
enum
{
    UART2_TX_HEAD_FIRST,			                    //头码1
    UART2_TX_HEAD_SECOND,		                        //头码2
    
    UART2_TX_CHKSUM = 65,//7,//254,                               //校验  
    UART2_TX_LEN    = 66,//8,//255,		                        //UART2发送字节长度
};
//---------------------------------------------------------------------------------------------------//
//===================================================================================================//
//---------------------------------------------------------------------------------------------------//
//UART3
//---------------------------------------------------------------------------------------------------//
#define		C_UART3_TX_HEAD_FIRST			0xFF        //发送头码1
#define		C_UART3_TX_HEAD_SECOND			0xFF        //发送头码2
//---------------------------------------------------------------------------------------------------//
#define		C_UART3_RX_HEAD_FIRST			0xFF        //接收头码1
#define		C_UART3_RX_HEAD_SECOND			0xFF        //接收头码2
//---------------------------------------------------------------------------------------------------//
enum
{
    UART3_RX_HEAD_FIRST,			                    //头码1
    UART3_RX_HEAD_SECOND,	                            //头码2

    UART3_RX_CHKSUM = 11,                               //校验
    UART3_RX_LEN    = 12,		                        //UART3接收字节长度
};
//---------------------------------------------------------------------------------------------------//
enum
{
    UART3_TX_HEAD_FIRST,			                    //头码1
    UART3_TX_HEAD_SECOND,		                        //头码2
    
//    UART3_TX_CHKSUM = 11,                               //校验  
//    UART3_TX_LEN    = 103,		                        //UART3发送字节长度
    UART3_TX_LEN    = 107,		                        //UART3发送字节长度  //27   lcx add db
};
//===================================================================================================//
//---------------------------------------------------------------------------------------------------//
//UART4
//---------------------------------------------------------------------------------------------------//
#define		C_UART4_TX_HEAD_FIRST			C_COMMDISP_TX_BYTE1        //发送头码1
#define		C_UART4_TX_HEAD_SECOND			C_COMMDISP_TX_BYTE2        //发送头码2
//---------------------------------------------------------------------------------------------------//
#define		C_UART4_RX_HEAD_FIRST			C_COMMDISP_RX_BYTE1        //接收头码1
#define		C_UART4_RX_HEAD_SECOND			C_COMMDISP_RX_BYTE2        //接收头码2
//---------------------------------------------------------------------------------------------------//
enum
{
    UART4_RX_HEAD_FIRST,			                    //头码1
    UART4_RX_HEAD_SECOND,	                            //头码2

    UART4_RX_CHKSUM = 15,                               //校验
    UART4_RX_LEN    = 16,		                        //UART4接收字节长度
};
//---------------------------------------------------------------------------------------------------//
enum
{
    UART4_TX_HEAD_FIRST,			                    //头码1
    UART4_TX_HEAD_SECOND,		                        //头码2
    
    UART4_TX_CHKSUM = 27,                               //校验  
    UART4_TX_LEN    = 28,		                        //UART4发送字节长度
};
//===================================================================================================//
//---------------------------------------------------------------------------------------------------//
//UART5
//---------------------------------------------------------------------------------------------------//
#define		C_UART5_TX_HEAD_FIRST			0xFF        //发送头码1
#define		C_UART5_TX_HEAD_SECOND			0xFF        //发送头码2
//---------------------------------------------------------------------------------------------------//
#define		C_UART5_RX_HEAD_FIRST			0xFF        //接收头码1
#define		C_UART5_RX_HEAD_SECOND			0xFF        //接收头码2
//---------------------------------------------------------------------------------------------------//
enum
{
    UART5_RX_HEAD_FIRST,			                    //头码1
    UART5_RX_HEAD_SECOND,	                            //头码2

    UART5_RX_CHKSUM = 11,                               //校验
    UART5_RX_LEN    = 12,		                        //UART5接收字节长度
};
//---------------------------------------------------------------------------------------------------//
enum
{
    UART5_TX_HEAD_FIRST,			                    //头码1
    UART5_TX_HEAD_SECOND,		                        //头码2
    
    UART5_TX_CHKSUM = 11,                               //校验  
    UART5_TX_LEN    = 12,		                        //UART5发送字节长度
};
//===================================================================================================//
/****************************************************************************************************
Function Name       :void    Module_Init_Uart0(void) 
Description         :初始化串口0
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    Uart0_Config(void);
/****************************************************************************************************
Function Name       :void	App_Uart0_Write_Frame(void)
Description         :根据功能应用发送信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void	App_Uart0_Write_Frame(void);
/****************************************************************************************************
Function Name       :void	App_Uart0_Read_Frame(void)
Description         :根据功能应用接收信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    App_Uart0_Read_Frame(void);
/****************************************************************************************************
Function Name       :void    Module_Init_Uart1(void) 
Description         :初始化串口1
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    Uart1_Config(void);
/****************************************************************************************************
Function Name       :void	App_Uart1_Write_Frame(void)
Description         :根据功能应用发送信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void	App_Uart1_Write_Frame(void);
/****************************************************************************************************
Function Name       :void	App_Uart1_Read_Frame(void)
Description         :根据功能应用接收信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    App_Uart1_Read_Frame(void);
/****************************************************************************************************
Function Name       :void    Module_Init_Uart2(void) 
Description         :初始化串口2
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    Uart2_Config(void);
/****************************************************************************************************
Function Name       :void	App_Uart2_Write_Frame(void)
Description         :根据功能应用发送信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void	App_Uart2_Write_Frame(void);
/****************************************************************************************************
Function Name       :void	App_Uart2_Read_Frame(void)
Description         :根据功能应用接收信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    App_Uart2_Read_Frame(void);
/****************************************************************************************************
Function Name       :void    Module_Init_Uart3(void) 
Description         :初始化串口3
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    Uart3_Config(void);
/****************************************************************************************************
Function Name       :void	App_Uart3_Write_Frame(void)
Description         :根据功能应用发送信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void	App_Uart3_Write_Frame(void);
/****************************************************************************************************
Function Name       :void	App_Uart3_Read_Frame(void)
Description         :根据功能应用接收信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    App_Uart3_Read_Frame(void);
/****************************************************************************************************
Function Name       :void    Module_Init_Uart4(void) 
Description         :初始化串口4
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    Uart4_Config(void);
/****************************************************************************************************
Function Name       :void	App_Uart4_Write_Frame(void)
Description         :根据功能应用发送信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void	App_Uart4_Write_Frame(void);
/****************************************************************************************************
Function Name       :void	App_Uart4_Read_Frame(void)
Description         :根据功能应用接收信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    App_Uart4_Read_Frame(void);
/****************************************************************************************************
Function Name       :void    Module_Init_Uart5(void) 
Description         :初始化串口5
Input               :无
Return              :无
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    Uart5_Config(void);
/****************************************************************************************************
Function Name       :void	App_Uart5_Write_Frame(void)
Description         :根据功能应用发送信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void	App_Uart5_Write_Frame(void);
/****************************************************************************************************
Function Name       :void	App_Uart5_Read_Frame(void)
Description         :根据功能应用接收信息帧
Input               :
Return              :
Author              :wuhaiming
Version             :V1.0
Revision History   1:
                   2:
****************************************************************************************************/
void    App_Uart5_Read_Frame(void);





//-----------------------lhh------------------------------//

typedef    struct
{
	unsigned char cont_Enable : 1;
	unsigned short set_Enable;
	unsigned char compHz;
	unsigned short indoor_Wind;
	unsigned short ourdoor_Wind;
	unsigned short elec_open;
	unsigned char four_is;
	unsigned char PFC_switch;
	unsigned char niuju_switch;
	unsigned char dianpure_switch;
	unsigned char outdoorHeat_switch;
	unsigned char	spare_one;
	unsigned short spare_two;
	unsigned short spare_three;
}l_contSend;
extern l_contSend l_contData;

void    Uart3_Config_lhh(void);
void F_CRC16(unsigned char *Array,  unsigned char Len);
void app_Rec(void);
void send_Three_Data(void);
void send_OneSix_Data(void);
uint16_t modbus_crc16(uint8_t *data, uint16_t length);


#endif
